/*
 *-------------------------------半刻设计工作室-------------------------------*
 *st_cp(12号引脚)，上升沿时将数据移位																			  
 *sh_cp(11号引脚)，上升沿时将数据输出                                        
 *OE(13号引脚)，高电平时禁止输出，用一个引脚控制它可达到闪烁效果         
 *ds(14号引脚)，数据串行输入口                                               
 *------------------------------------------------------------------------------*
*/
#include "74hc595.h"


uchar send_byte(uchar n,uchar ds, bit st_cp, bit sh_cp)
{
	uchar i=0;
	ds=n;//串行数据输入
	st_cp=0;//输入存储器锁存时钟
	sh_cp=0;//数据输入时钟	
	for(i=0;i<8;i++)
	{
		if(ds&0x01)
			ds=1;
		else
			ds=0;
		ds = ds >>1;
		st_cp=1;//上升沿，移位
		st_cp=0;//拉低，等待下次上升沿使用
	}
	sh_cp=1;//上升沿8位数据并行输出
	return ds;
}