#include "display.h"
#include "main.h"
#include "74hc595.h"
unsigned char seg_code[]={ 
			0x3F,  //"0"
			0x06,  //"1"
			0x5B,  //"2"
			0x4F,  //"3"
			0x66,  //"4"
			0x6D,  //"5"
			0x7D,  //"6"
			0x07,  //"7"
			0x7F,  //"8"
			0x6F,  //"9"
			0x77,  //"A"
			0x3E,  //"u"
			0x40,  //"-"
			0x00  //
     };
uchar array[]={0,0,0};//用于保存数据分解结果

/*
 *------------------------------------------------------------------------------*
 *该循环减法的分解速度优于使用/与%分解																		  
 *                                        
 *         
 *                                              
 *------------------------------------------------------------------------------*
*/
void INT_to_dight(uchar n)
{
	array[0]=0;
	while(n>=100)
	{
		array[0]++;
		n-=100;
	}
	array[1]=0;
	while(n>=10)
	{
		array[0]++;
		n-=10;
	}
	array[2]=n;
}
/*
 *------------------------------------------------------------------------------*
 *void display(电压，电流，数码管位数，电压闪烁使能，电流闪烁使能);																	  
 *                                        
 *         
 *                                              
 *------------------------------------------------------------------------------*
*/
void display(uchar dight, int dat,bit ENU,bit ENI)
{
	uchar i=0;
	ENU=0;
	ENI=0;
	INT_to_dight(dat);//分解数位
	for(i=0;i<dight;i++)
	{
		send_byte(0xff, DS1 ,ST_CP1, SH_CP1); //位选关闭
		send_byte(0xff, DS2 ,ST_CP2, SH_CP2); 
		
	}
}